alejandro-colomar/stm32l4-modules/base/src/errors.c
/******************************************************************************
 *	Copyright (C) 2018	Colomar Andrés, Alejandro		      *
 *	SPDX-License-Identifier:	LGPL-2.0-only			      *
 ******************************************************************************/

/**
 *	@file		errors.c
 *	@author		Colomar Andrés, Alejandro
 *	@copyright	LGPL-2.0-only
 *	@date		2018/dec/13
 *	@brief		errors
 */


/******************************************************************************
 ******* headers **************************************************************
 ******************************************************************************/
	#include <stdbool.h>
	#include <stdint.h>

	#include "stm32l4xx_hal.h"

	#include "stm32l4-modules/delay.h"
	#include "stm32l4-modules/led.h"

	#include "stm32l4-modules/errors.h"


/******************************************************************************
 ******* macros ***************************************************************
 ******************************************************************************/
#define ERROR_BIT_LEN			(UINT32_C(1000000))
#define ERROR_LONG_PULSE_LEN_US		((uint32_t)(ERROR_BIT_LEN * 0.6))
#define ERROR_SHORT_PULSE_LEN_US	((uint32_t)(ERROR_BIT_LEN * 0.1))


/******************************************************************************
 ******* enums ****************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* structs **************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* variables ************************************************************
 ******************************************************************************/
/* Volatile ------------------------------------------------------------------*/
/* Global --------------------------------------------------------------------*/
	uint32_t	prj_error	= 0;
/* Static --------------------------------------------------------------------*/


/******************************************************************************
 ******* static functions (prototypes) ****************************************
 ******************************************************************************/
static	void	flash_error	(void);
static	void	flash_long	(void);
static	void	flash_short	(void);


/******************************************************************************
 ******* global functions *****************************************************
 ******************************************************************************/
	/**
	 * @brief	Handle error
	 *		Displays the error value by flashing a led from MSB
	 *		to LSB.  A long flash is a 1 and a short flash is a 0.
	 *		After displaying the value, it resets 'prj_error'.
	 */
void	prj_error_handle	(void)
{
	int	i;

	led_reset();
	delay_us(1000000u);

	for (i = 0; i < 10; i++) {
		led_set();
		delay_us(50000u);
		led_reset();
		delay_us(50000u);
	}

	led_reset();
	delay_us(1000000u);

	flash_error();

	prj_error	= 0;
}


/******************************************************************************
 ******* static functions (definitions) ***************************************
 ******************************************************************************/
static	void	flash_error	(void)
{
	int	i;

	for (i = 31; i >= 0; i--) {
		if (prj_error & (UINT32_C(1) << i))
			flash_long();
		else
			flash_short();
	}
}

static	void	flash_long	(void)
{
	led_set();
	delay_us(ERROR_LONG_PULSE_LEN_US);

	led_reset();
	delay_us(ERROR_BIT_LEN - ERROR_LONG_PULSE_LEN_US);
}

static	void	flash_short	(void)
{
	led_set();
	delay_us(ERROR_SHORT_PULSE_LEN_US);

	led_reset();
	delay_us(ERROR_BIT_LEN - ERROR_SHORT_PULSE_LEN_US);
}


/******************************************************************************
 ******* end of file **********************************************************
 ******************************************************************************/
